cases/H2.Unsteady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1629
(
(-0.829832750513 1.78237836902e-15 58.5847702581)
(-3.73611161645 7.13960220471e-16 58.717767345)
(6.62825816131 5.55678326317e-17 54.8154515326)
(1.28801050527 1.52249239658e-15 59.9594937073)
(-1.49727378099 7.38733607506e-16 59.8372741447)
(4.03645407337 6.75739809408e-17 53.7806102517)
(0.749492858638 2.9612677228e-16 62.4821947357)
(-2.09917263524 -1.56391582786e-15 61.9466218804)
...
)
;

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform (0 0 60);
    }
    inletair
    {
        type            fixedValue;
        value           uniform (0 0 2);
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    burnerwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
