cases/H2.Unsteady/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
1629
(
50781.7882311
133770.494095
784233.887867
47365.4930076
148033.472623
1224173.86387
52119.7608138
178687.856155
...
)
;

boundaryField
{
    inletfuel
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 1630.0935556;
    }
    inletair
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 0.0603738353925;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           nonuniform List<scalar> 
26
(
56.5688691196
56.6483085391
56.8182966317
57.0437463302
57.5284875821
58.6382270338
60.0841244935
61.5848847843
...
)
;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            compressible::epsilonWallFunction;
        value           nonuniform List<scalar> 
65
(
1.48558325377
2.63773055442
0.230337463905
0.241160484954
0.249776245706
2.63773055442
3.24708289443
3.89073237532
...
)
;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    burnerwall
    {
        type            compressible::epsilonWallFunction;
        value           nonuniform List<scalar> 7(784233.887867 1224173.86387 1449328.31674 3.49602696349 4.92931073199 13.7184609497 60133.3764727);
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
