cases/H2.Unsteady/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1629
(
18.9268078572
24.1401479609
68.7284625928
16.2952986997
24.4699547453
92.3882025062
16.3372954765
26.37441305
...
)
;

boundaryField
{
    inletfuel
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 13.5;
    }
    inletair
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           nonuniform List<scalar> 
26
(
1.52315801007
1.52417742212
1.52629408418
1.52902813148
1.53467802489
1.54554656394
1.55721558594
1.56484336236
...
)
;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
65
(
0.0248797983089
0.0289079985012
0.0157204335404
0.0162090998619
0.0165928969793
0.0289079985012
0.0332042112349
0.0374586309804
...
)
;
    }
    burnerwall
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 7(68.7284625928 92.3882025062 103.679566808 0.0349715105385 0.0439743284426 0.0872716135225 29.584819265);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
