cases/H2.Unsteady/constant/drgOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

DRG 
{
	drg			off;
	minTemperature		300;
	species			( H2 O2 N2 );
	epsilon			(0.1   0.08 0.05  0.01  );
	temperature		(600.  900. 1300. 4000. );
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
