cases/H2.Unsteady/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
"(rho|rhoFinal)"
    {
        solver              PCG;
        preconditioner      DIC;
        tolerance           1e-6;
        relTol              0;
    };

    p
    {
        solver              	GAMG;
        tolerance           	1e-6;
        relTol              	0.1;
        smoother            	GaussSeidel;
        cacheAgglomeration  	true;
        nCellsInCoarsestLevel   10;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
    };

    pFinal
    {
        $p;
        tolerance           1e-6;
        relTol              0;
    };

    "(U|h|k|epsilon)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          1e-3;
    }

    GFinal
    {
        $G;
        relTol          0;
    }
}

PIMPLE
{

    momentumPredictor 		yes;
    nOuterCorrectors  		1;
    nCorrectors       		2;
    nNonOrthogonalCorrectors 	0;
    consistent			yes;

    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.01;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.00;
}


// ************************************************************************* //
